export const taskPersons = [
    {
        question: "What do you do?",
        correctAnswer: 2,
        answers: [
            {
                number: 1,
                text: "HHHHH",
            },
            {
                number: 2,
                text: "HHHHH",
            },
            {
                number: 3,
                text: "HHHHH",
            },
            {
                number: 4,
                text: "HHHHH",
            },
        ],
    },
];

export const taskStatement = [
    {
        statement:
            "Реактивная система БМ-13 («Катюша») была принята на вооружение за день до начала Великой Отечественной войны.",
        bool: true,
    },
    {
        statement:
            "Первая ядерная бомба была разработана в Германии",
        bool: false,
    },
    {
        statement:
            "Автоматическую сварку танковой брони под флюсом внедрил академик Евгений Патон.",
        bool: true,
    },
    {
        statement:
            "ЭВМ «Колосс» была создана в Германии для управления ракетными пусками V-2.",
        bool: false,
    },
    {
        statement:
            "Первый отечественный антибиотик военного времени назыв ался Крустозин.",
        bool: true,
    },
    {
        statement:
            "Первый искусственный ядерный реактор запустили в Москве в 1943 году.",
        bool: false,
    },
    {
        statement:
            "Ракета V-2 стала первой в мире успешно запущенной баллистической ракетой.",
        bool: true,
    },
    {
        statement:
            "Модернизированный Т-34-85 получил 85-мм пушку, чтобы бороться с немецкими танками.",
        bool: true,
    },
    {
        statement:
            "Первый акваланг успешно испытали Жак-Ив Кусто и Эмиль Ганьян в 1943 году.",
        bool: true,
    },
    {
        statement:
            "Вес танка Т-34-85 составлял всего 5 тонны",
        bool: false,
    },
    {
        statement:
            "Советский истребитель Ла-5 изготавливался преимущественно из дерева.",
        bool: true,
    },
    {
        statement:
            "Пенициллин был открыт Александром Флемингом в 1928 году",
        bool: true,
    },
    {
        statement:
            "Штурмовик Ил-2 в советских войсках называли «летающим танком».",
        bool: true,
    },
    {
        statement:
            "Шифровальная машина «Энигма» использовалась немецким командованием для передачи секретных сообщений.",
        bool: true,
    },
    {
        statement:
            "Битва за Курскую дугу вошла в историю как крупнейшее танковое сражение Второй мировой войны.",
        bool: true,
    },
    {
        statement:
            "Реактивная система БМ-13 («Катюша») могла перевозить только 1 человека",
        bool: false,
    },
    {
        statement:
            "Советский союз начал разрабатывать свою атомную бомбу только после Великой Отчественной войны",
        bool: false,
    },
    {
        statement:
            "Одним из создателей танка T-34 был Георгий Шпагин",
        bool: false,
    },
    {
        statement:
            "Михаил Кошкин разработал пулемёт ППШ-41",
        bool: false,
    },
];
